#pragma once

// SCUM (0.1.17) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SCUM_ABP_Bear2_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_Bear2.ABP_Bear2_C
// 0x1AE8 (0x1EF8 - 0x0410)
class UABP_Bear2_C : public UComplexAnimal2AnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0410(0x0008) (CPF_Transient, CPF_DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_6F3D2E5B4C3D9F0ADCFF4CAB2F445396;      // 0x0418(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63BCDC234581E6A694FD42BDC3A98F22;// 0x0460(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8A6E0CE4491F19DD6849283BB594B76;// 0x04E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFAA75EB4333BC57365E2BA048454338;// 0x0560(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF53EBB94D5273352B15AE990CE4028F;// 0x05E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A234E2794190D24DBE7071B312692FCE;// 0x0660(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF6BA010473CCA02CE4AC286BABED386;// 0x06E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BD5B6567401BD162857F8DBC0A40BAE5;// 0x0760(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C915EEA34638A0703F325CB8283BB5E4;// 0x07E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ADC209F54F0CC4CE5FD077AE04B233E0;// 0x0860(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD36E27B4EF1E2C41FE154B43FEF6385;// 0x08E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C0FF907147C3A57CC9BFA490D5558CBF;// 0x0960(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_943E1A2A4F1B634750D6ACB31CE2B949;// 0x09E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6FEAE2654575D281782070AAD38286CF;// 0x0A60(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_669FAF824C9495F18B09BDA87884A786;// 0x0AE0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C96B0AA64329CFC34AA94D914F72B353;// 0x0B50(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C6666CBC471A94B36532F3A91116BCFC;// 0x0BC0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E33A89A64DB68128785C38AE1CCE45D5;// 0x0C90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CC8CDF834B09DE576720979677C4504B;// 0x0CD8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19A9934740724B3880A9B797CB25D377;// 0x0D48(0x0070)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_F5E190CC437ADBCC4856B8BCD454F165;// 0x0DB8(0x0090)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_65F7B11046145A47D1DB1882DCDE07EB;// 0x0E48(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_106E8AF2439FFD9056DBB7922862EE25;// 0x0F18(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7C5068F3493335123ECF8B807975DFFC;// 0x0F60(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C4B40B104A348DA99C36459CB841A060;// 0x0FD0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_127F30EA495B3F6B671696B877B540E6;// 0x1018(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D403B3E840D0CF125F09C9BD12B1C592;// 0x1088(0x0048)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_BD8A63F34B512B448EEE5480C01ED20C;// 0x10D0(0x0090)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_CDB842B1455816FF7543DC9B04E21E4C;// 0x1160(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D6ED4E64A34470FFF4574943CD93E52;// 0x11F0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8ACA72B2456E63F9E02630949341DE5F;// 0x1260(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_6F17F824404C427B6936D0A110F495D6;// 0x12D0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3FC0D5694ED71FB84B60C0B48883965F;// 0x13A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3256F6814E3238AB5C391AAC44722469;// 0x13E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0A112F0846160D0B049E368DB44ABB71;// 0x1458(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FD5BC7B4432867F5CAE1229C4CE9E9D9;// 0x14A0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1896F6EC46A0CDB05764BAAED5B5D182;// 0x1510(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2463D0B1484CEFB6CFB588859DEA744C;// 0x1558(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0351DD0B4FFD79AC9A448F8FD6819518;// 0x15C8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0BB7BA82483C06CC5D56FA92401504B7;// 0x1610(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F51B678E4F35E8C51445C1893ADCEB6A;// 0x1738(0x0048)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_32DEDC4C47C98C3B531F67BB026DD926;// 0x1780(0x0090)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_9110A8A546C7202AD9B507A41366D4B1;// 0x1810(0x0090)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_B2CF7E0E4A96C1DF507CBE801D75B8E0;// 0x18A0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3474224D41964B360BBFEDB772BE3F4F;// 0x1980(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_63B3479D4D09932B45221D894AE29453;// 0x19F0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_896C4B53429ABA1E3E30D2865BB83C50;// 0x1A60(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A2159B174826B1AB6A7A7AA12491F12F;// 0x1AD0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9CBC4BC4425212FC4823E28BF98A0765;// 0x1B18(0x00D8)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_17AA7D4841CE1445E40145BC99F1718F;// 0x1BF0(0x0158)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_5231E04D4609F907195FAF81E9B3C374;      // 0x1D48(0x0068)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F374E05F4685A8929F842AB7B9FBD73A;// 0x1DB0(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_918E38D241DD17E4EE51D4823E573A90;// 0x1E68(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2BBBB33C40AAF2774BA722A3EDD6CA22;// 0x1EB0(0x0048)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("AnimBlueprintGeneratedClass ABP_Bear2.ABP_Bear2_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_SequencePlayer_C96B0AA64329CFC34AA94D914F72B353();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_BlendListByBool_C6666CBC471A94B36532F3A91116BCFC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_BD5B6567401BD162857F8DBC0A40BAE5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_BlendListByInt_65F7B11046145A47D1DB1882DCDE07EB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_FF6BA010473CCA02CE4AC286BABED386();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_A234E2794190D24DBE7071B312692FCE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_BlendSpacePlayer_0BB7BA82483C06CC5D56FA92401504B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_EF53EBB94D5273352B15AE990CE4028F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_BlendListByEnum_B2CF7E0E4A96C1DF507CBE801D75B8E0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_RotationOffsetBlendSpace_17AA7D4841CE1445E40145BC99F1718F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_ModifyBone_F374E05F4685A8929F842AB7B9FBD73A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_FFAA75EB4333BC57365E2BA048454338();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_F8A6E0CE4491F19DD6849283BB594B76();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_C915EEA34638A0703F325CB8283BB5E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_943E1A2A4F1B634750D6ACB31CE2B949();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_63BCDC234581E6A694FD42BDC3A98F22();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_SequencePlayer_669FAF824C9495F18B09BDA87884A786();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_FD36E27B4EF1E2C41FE154B43FEF6385();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bear2_AnimGraphNode_TransitionResult_ADC209F54F0CC4CE5FD077AE04B233E0();
	void ExecuteUbergraph_ABP_Bear2(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
